In [ ]:
!pip install boto3
from pandas import DataFrame, read_sql
from boto3 import client
from datetime import datetime

Requirement already satisfied: boto3 in /usr/local/lib/python3.7/dist-packages (1.17.90)
Requirement already satisfied: s3transfer<0.5.0,>=0.4.0 in /usr/local/lib/python3.7/dist-packages (from boto3) (0.4.2)
Requirement already satisfied: jmespath<1.0.0,>=0.7.1 in /usr/local/lib/python3.7/dist-packages (from boto3) (0.10.0)
Requirement already satisfied: botocore<1.21.0,>=1.20.90 in /usr/local/lib/python3.7/dist-packages (from boto3) (1.20.90)
Requirement already satisfied: python-dateutil<3.0.0,>=2.1 in /usr/local/lib/python3.7/dist-packages (from botocore<1.21.0,>=1.20.90->boto3) (2.8.1)
Requirement already satisfied: urllib3<1.27,>=1.25.4 in /usr/local/lib/python3.7/dist-packages (from botocore<1.21.0,>=1.20.90->boto3) (1.26.5)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil<3.0.0,>=2.1->botocore<1.21.0,>=1.20.90->boto3) (1.15.0)

# ORGANIZAR DATAFRAMES

In [ ]:
ACCESS_KEY = '***********'
SECRET_KEY = '*****************************'

s3 = client('s3', aws_access_key_id=ACCESS_KEY , aws_secret_access_key=SECRET_KEY)
s3.download_file('covidapiaws', 'countries.json', 'countries.json')

In [ ]:
from json import load
fObj = open('countries.json',)
countries = load(fObj)
print(len(countries))

191

In [ ]:
for i, key in enumerate(countries):
  if i == 0:
    df0 = DataFrame(countries[key])
  else:
    df0 = df0.append(countries[key])
print(df0.shape)

(787728, 13)

In [ ]:
dfStatistic = df0[df0["Province"] == ""].copy()
print(dfStatistic.shape)

(96042, 13)

In [ ]:
# for code in country.CountryCode.unique():
  # n = len(country[country["CountryCode"] == code])
  # if n < maxDays:
  #   print(code, n)
  # if n > maxDays:
  #   print(code, n, "!")

In [ ]:
dfCountry = dfStatistic[["CountryCode", "Country",	"Lat",	"Lon"]].drop_duplicates()
dfCountry["Lat"] = dfCountry["Lat"].astype(float)
dfCountry["Lon"] = dfCountry["Lon"].astype(float)
print(dfCountry.shape)
dfCountry.head(5)

(191, 4)

  CountryCode            Country    Lat    Lon
0          SK           Slovakia  48.67  19.70
0          MM            Myanmar  21.91  95.96
0          MG         Madagascar -18.77  46.87
0          GQ  Equatorial Guinea   1.65  10.27
0          GA              Gabon  -0.80  11.61

In [ ]:
dfStatistic.drop(["ID", "Province", "City", "CityCode", "Country",	"Lat",	"Lon"], axis=1, inplace=True)
dfStatistic["Date"] = dfStatistic["Date"].astype('datetime64')
print(dfStatistic.shape)
dfStatistic.head(5)

(96042, 6)

  CountryCode  Confirmed  Deaths  Recovered  Active       Date
0          SK          0       0          0       0 2020-01-22
1          SK          0       0          0       0 2020-01-23
2          SK          0       0          0       0 2020-01-24
3          SK          0       0          0       0 2020-01-25
4          SK          0       0          0       0 2020-01-26

# GRAVAR DATAFRAMES NO BANCO DE DADOS

In [ ]:
!pip install mysql-connector-python
from sqlalchemy import create_engine
engine = create_engine('mysql+mysqlconnector://covidinfo:covidinfo@mysqlcovid.cleihb7e37rw.us-east-1.rds.amazonaws.com/covidinfo')

Requirement already satisfied: mysql-connector-python in /usr/local/lib/python3.7/dist-packages (8.0.25)
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.7/dist-packages (from mysql-connector-python) (3.12.4)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Requirement already satisfied: setuptools in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (57.0.0)

mydb = mysql.connector.connect(

  host="mysqlcovid.cleihb7e37rw.us-east-1.rds.amazonaws.com",

  user="covidinfo",

  password="covidinfo",
  
  database="covidinfo"
)

In [ ]:
# dfCountry.to_sql('country', engine, if_exists='append', index=False)

In [ ]:
# dfStatistic.to_sql('statistic', engine, if_exists='append', index=False)

In [ ]:
read_sql("select * from statistic", engine)

      countryCode        date  confirmed  deaths  recovered  active
0              AD  2020-01-22          0       0          0       0
1              AD  2020-01-23          0       0          0       0
2              AD  2020-01-24          0       0          0       0
3              AD  2020-01-25          0       0          0       0
4              AD  2020-01-26          0       0          0       0
...           ...         ...        ...     ...        ...     ...
96037          ZW  2021-06-03      39092    1604      36680     808
96038          ZW  2021-06-04      39144    1605      36690     849
96039          ZW  2021-06-05      39168    1605      36698     865
96040          ZW  2021-06-06      39189    1606      36728     855
96041          ZW  2021-06-08      39238    1611      36746     881

[96042 rows x 6 columns]

In [ ]:
read_sql("select * from country", engine)

    countryCode               country    lat    lon
0            AD               Andorra  42.55   1.60
1            AE  United Arab Emirates  23.42  53.85
2            AF           Afghanistan  33.94  67.71
3            AG   Antigua and Barbuda  17.06 -61.80
4            AL               Albania  41.15  20.17
..          ...                   ...    ...    ...
186          XK    Republic of Kosovo  42.60  20.90
187          YE                 Yemen  15.55  48.52
188          ZA          South Africa -30.56  22.94
189          ZM                Zambia -13.13  27.85
190          ZW              Zimbabwe -19.02  29.15

[191 rows x 4 columns]